Tecnologia/64980588.md

Suport Tècnic : SIR 2.0 - FLUX DEL SERVEI - ERRORS - Tràmits reenviats on el reenviament no s'ha produït  

1.  [Suport Tècnic](index.html)
2.  [Suport Tècnic](13893782.html)
3.  [02 - FAQ's serveis](26313393.html)
4.  [FAQ's SIR 2.0](41523073.html)

Suport Tècnic : SIR 2.0 - FLUX DEL SERVEI - ERRORS - Tràmits reenviats on el reenviament no s'ha produït
========================================================================================================

Created by Unknown User (otecobernal), last modified on 07 March 2022

Explicació

A les recepcions del SIR, quan un ens d'EACAT rep un tràmit, pot fer 3 accions; Confirmar, Rebutjar o Reenviar. Si un ens decideix reenviar el tràmit a una altra entitat, el tràmit es quedarà en estat REENVIAT i apareixerà un tràmit nou a la base de dades (mateix id\_sir però diferent id).

A vegades, el reenviament es produeix i el tràmit s'actualitza a estat REENVIAT, però no es genera un tràmit nou (que fa efectiu el reenviament):

![](attachments/64980588/64980603.png)

Solució:
--------

Les accions a realitzar per aquest tipus d'error:

1.  Buscar el tràmit
    
     select case
              when i.tipus = 0 then 'Enviament'
              when i.tipus = 1 then 'Recepció'
            end as TIPUS\_INTERCANVI,
            case
              when i.estat = 0 then 'Pendent d''enviar'
              when i.estat = 1 then 'Pendent de confirmar'
              when i.estat = 2 then 'Confirmat'
              when i.estat = 3 then 'Rebutjat'
              when i.estat = 4 then 'Reenviat'
              when i.estat = 5 then 'Error'
            end as ESTAT\_LITERAL,
            case
              when a.tipus = 0 then 'Enviament'
              when a.tipus = 1 then 'Reenviament'
              when a.tipus = 2 then 'Rebuig'
              when a.tipus = 3 then 'ACK'
              when a.tipus = 4 then 'Error'
              when a.tipus = 5 then 'Confirmació'
              when a.tipus = 6 then 'Reenviament a inici'
            end as TIPUS\_APUNT,
            i.\*,
            a.\*
       from SIR\_PCI.SIR\_INTERCANVI i, SIR\_PCI.SIR\_APUNT a
      where a.id\_intercanvi = i.id
        --and i.registre\_sortida = 'XXX'
        and i.origen\_registre\_entrada = 'XXX'
        --and i.desti\_registre\_entrada = 'XXX'
        and i.codi\_ens = 'XXX'
      order by a.data, i.id desc;
    
2.  Modificar l'estat a Pendent de Confirmar
    
     update SIR\_PCI.SIR\_INTERCANVI
       set estat = 1 --Pendent de confirmar
     where id = XXX
    
3.  Enviar una nova petició de reenviament:  
    Podrem trobar el projecte de SoapUI del SIR al SS de PCI30 (sota el directori **docs/proves**). Haurem de modificar les dades de l'XML amb les dades del tràmit i fer una petició de reenviament:
    
    Podrem llençar la petició directament contra la MTI per evitar signar amb el certificat de l'ens. Haurem d'introduir les dades:
    
    *   **IdentificadorSolicitante**: El codi de l'ens informat a la bdd del tràmit (columna **SIR\_INTERCANVI.CODI\_ENS**)
    *   **NombreSolicitante**: El nom de l'ens a qui correspongui el codi:
        
         select \* from usu\_ens e where e.uen\_codi\_10 = '9610210007'
        
    *   **Finalidad**: La finalitat que l'ens tingui donada d'alta, normalment **TRAMITACIO**
    *   **idEnviamentSIR**: L'id del SIR (columna **SIR\_INTERCANVI.ID\_SIR**)
    *   **oficinaRegistreDesti**: El destinatari del reenviament (columna **SIR\_APUNT.OFICINA\_DESTI**)
        
        No ens podem confondre, haurem d'agafar el valor del camp OFICINA\_DESTI per l'apunt que sigui de tipus REENVIAMENT i sigui el reenviment que hagi fallat:  
        ![](attachments/64980588/64980604.png)
        
    *   **observacions**: El motiu del reenviament (columna **SIR\_APUNT.MISSATGE**)
        
        Com en el cas anterior, no ens podem confondre, haurem d'agafar el valor del camp MIssatge per l'apunt que sigui de tipus REENVIAMENT i sigui el reenviment que hagi fallat:  
        ![](attachments/64980588/64980604.png)
        
    
      
    Exemple de petició:
    
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/" xmlns:pet="http://gencat.net/scsp/esquemes/peticion">
       <soapenv:Header/>
       <soapenv:Body>
          <open:procesa>
             <Peticion xmlns="http://gencat.net/scsp/esquemes/peticion">
                <Atributos>
                   <IdPeticion>CUX-SIR-RECEPCIO-${=(long)(System.currentTimeMillis())}</IdPeticion>
                   <NumElementos>1</NumElementos>
                   <TimeStamp/>
                   <CodigoCertificado>SIR</CodigoCertificado>
                   <CodigoProducto>SIR</CodigoProducto>
                   <DatosAutorizacion>
                      <IdentificadorSolicitante>XXX</IdentificadorSolicitante>
                      <NombreSolicitante>XXX</NombreSolicitante>
                      <Finalidad>TRAMITACIO</Finalidad>
                   </DatosAutorizacion>
                </Atributos>
                <Solicitudes>
                   <SolicitudTransmision>
                      <DatosGenericos>
                         <Solicitante>
                            <IdentificadorSolicitante>XXX</IdentificadorSolicitante>
                            <NombreSolicitante>XXX</NombreSolicitante>
                            <Finalidad>TRAMITACIO</Finalidad>
                            <Consentimiento>Si</Consentimiento>
                         </Solicitante>
                         <Transmision>
                            <CodigoCertificado>SIR</CodigoCertificado>
                            <IdSolicitud>1</IdSolicitud>
                            <IdTransmision/>
                            <FechaGeneracion/>
                         </Transmision>
                      </DatosGenericos>
                      <DatosEspecificos>
                         <peticioReenviamentAssentament xmlns="http://www.aoc.cat/sir">
                            <idEnviamentSIR>XXX</idEnviamentSIR>
                            <oficinaRegistreDesti>XXX</oficinaRegistreDesti>                        
                            <observacions>XXX</observacions>
                         </peticioReenviamentAssentament>
                      </DatosEspecificos>
                   </SolicitudTransmision>
                </Solicitudes>
             </Peticion>
          </open:procesa>
       </soapenv:Body>
    </soapenv:Envelope>
    
4.  Sincronitzar-lo amb EACAT
    
    select \* from SIR\_PCI.SIR\_SINCRONITZACIO WHERE ID\_INTERCANVI = XXX
    
    update SIR\_PCI.SIR\_SINCRONITZACIO
       set sincronitzat\_eacat = 0 --Pendent de sincronitzar
     where id\_intercanvi = XXX
    

Finalment, haurem de veure que a la base de dades (podrem utilitzar la query inicial) que efectivament el tràmit torna a estar en estat REENVIAT, però aquest cop apareix una nova fila amb un identificador nou que es troba en estat pendent de confirmar:

![](attachments/64980588/64980605.png)

  

Attachments:
------------

![](images/icons/bullet_blue.gif) [image2021-5-17\_10-44-6.png](attachments/64980588/64980589.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_11-47-42.png](attachments/64980588/64980590.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_11-56-48.png](attachments/64980588/64980591.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_11-59-38.png](attachments/64980588/64980592.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_12-0-6.png](attachments/64980588/64980593.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_12-1-4.png](attachments/64980588/64980594.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-19\_13-35-20.png](attachments/64980588/64980595.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-19\_13-36-41.png](attachments/64980588/64980596.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-19\_13-47-3.png](attachments/64980588/64980597.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2021-5-17\_11-48-23.png](attachments/64980588/64980598.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-1-11\_12-12-59.png](attachments/64980588/64980599.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-1-11\_12-13-42.png](attachments/64980588/64980600.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-3-7\_16-22-25.png](attachments/64980588/64980601.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-3-7\_16-23-11.png](attachments/64980588/64980602.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-3-7\_16-23-32.png](attachments/64980588/64980603.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-3-7\_16-34-50.png](attachments/64980588/64980604.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2022-3-7\_16-38-38.png](attachments/64980588/64980605.png) (image/png)  

Document generated by Confluence on 02 June 2025 10:59

[Atlassian](http://www.atlassian.com/)